app/controllers/employees_controller.rb

	def create
		# Bad way to save values from param in the db
		# @employee = Employee.create(first_name: params[:employee][:first_name], middle_name: params[:employee][:middle_name], last_name: params[:employee][:last_name], personal_email: params[:employee][:personal_email], city: params[:employee][:city], state: params[:employee][:state], country: params[:employee][:country], pincode: params[:employee][:pincode], address_line_1: params[:employee][:address_line_1], address_line_2: params[:employee][:address_line_2])
		# Correct way
		@employee = Employee.new(employee_params)
		if @employee.save
---
INSERT INTO "employees" ("first_name", "middle_name", "last_name", "personal_email", "city", "state", "country", "pincode", "address_line_1", "address_line_2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

	def update
		@employee = Employee.find(params[:id])
		if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "employees" SET "address_line_1" = ?, "address_line_2" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address_line_1", "ludhiana"], ["address_line_2", ""], ["updated_at", "2024-01-10 09:33:16.087075"], ["id", 5]]

	def destroy
		@employee = Employee.find(params[:id])
		if @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]